//     Создайте объект Старбакса, там будут главные поля кофе, чай. В поле кофе будут еще поля в
//     разновидностями кофе, их значениями должны быть описания этих кофе , можете от себя
//     добавить что-то, это только приветствуется. Тоже самое и с чаем.Правильно постройте
//     архитектуру объекта. Затем, после того как объект уже будет готов , напишите логику
//     принятия заказа,то есть пользователь вводит название кофе или чая и если такой кофе
//     или чай есть в объекте, то принять заказ, а если нет, то error) По желанию можете
//     усложнить себе задачу и значениями некоторых кофе сделать false, типо такой кофе не в наличии
//     и если пользователь выберет такой кофе, где хранится false, то сообщением вывести
//     «выберите что-то другое и так далее»


var Starbucks = {
    drinks: {
        coffee: {
            latte: "Латте готовится из эспрессо и вспененного молока.",
            americano: "Американо готовят из эспрессо и горячей воды.",
            cappuccino: "Капучино готовится из эспрессо, вспененного молока и молочной пены."
        },
        tea: {
            green: "Зеленый чай производится из листьев Camellia sinensis.",
            black: "Черный чай изготовлен из листьев Camellia sinensis и полностью ферментирован.",
            chai: "Чай — это пряный чай, приготовленный из черного чая, молока и специй."
        }
    }
}

var order= prompt("Выберите напиток coffee: latte, americano, cappuccino. tea: green, black, chai")
if (order in Starbucks.drinks.coffee){
    console.log("Сейчас вам принесут ваш кофе")
    alert("Подожди, а то успеешь ;)")
} else if (order in Starbucks.drinks.tea) {
    console.log("Сейчас вам принесут ваш чай")
    alert("Подожди, а то успеешь ;)")
} else {
    console.log("У нас нет такого напитка")
    alert("Сказки не выдумывай!!! :)")
}
